tutorials/pisoTurbinesFoam/axialFlowWindTurbine/constant/turbineArrayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineArrayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
globalProperties
{
    outputControl       "timeStep";
    outputInterval       1;
}
 
turbine1
{
    turbineType         "NREL5MWRef";
    baseLocation        (3396.9131 2696.6644 0.0);
    numBladePoints      40;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon             3.5;
    tipRootLossCorrType "none";
    rotationDir         "cw";
    azimuth             232.0105;
    torqueGen		200.0;
    rotSpeed            10.9874;
    pitch               0;
    nacYaw              221.617;
    fluidDensity        1.23;
}
